//
//  Post.swift
//  BeforeIn
//
//  Created by t2023-m079 on 10/23/23.
//

import Foundation

struct Post{
    let writer: String // email
    let writerNickName: String
    let postID: String
    let title: String
    let content: String
    var comments: [Comment]
    let likes: Int
    let category: String
    let postingTime: Date
    var reportUserList: [String] //신고한 사람들의 이메일 리스트
}

let postPlaceholder = """
내용을 입력하세요. (2,000자 이하)

비포인(BeforeIn)은 누구나 에티켓을 지키며 쾌적하고 원활하게 참여할 수 있는 커뮤니티를 만들기 위해 커뮤니티(이하 ‘에티켓숲’) 이용규칙을 제정하여 운영하고 있습니다. 위반시 게시물이 삭제될 수 있습니다.

아래는 이 게시판에 해당하는 핵심 요약 사항이며, 게시물 작성전 에티켓숲 이용규칙(내 정보탭 커뮤니티 항목)을 클릭하여 이용규칙 전문을 **반드시** 확인하시기 바랍니다. 이용규칙을 숙지하지 않아 발생하는 피해에 대하여 서비스제공팀은 어떠한 책임도 지지 않습니다.

1. 위반 시 조치:
- 이용규칙을 위반하여 신고가 누적될 경우, 게시글이 통보없이 블라인드 처리 될 수 있습니다.
- 잦은 블라인드 처리의 경우 통보없이 계정이 제한되어 서비스 이용이 중단될 수 있습니다.

2. 존중과 예의:
- 다른 사용자들을 존중하며 예의를 갖춥니다.
- 모든 의견은 존중받을 수 있어야 하며, 비방, 모욕, 혐오 발언은 금지됩니다.

3. 안전한 환경 유지:
- 개인 정보 보호를 존중하며, 타인의 개인 정보를 무단으로 공유하는 행위는 엄격히 금지됩니다.
- 사기, 해킹, 악성 소프트웨어 등을 유발하는 행동은 금지되어야 합니다.

4. 콘텐츠의 적절성:
- 선정적이거나 불건전한 콘텐츠의 게시는 허용되지 않습니다.
- 불법 콘텐츠의 게시 및 광고는 금지되어야 합니다.

5. 지적 재산권 존중:
- 다른 사람의 저작권 및 상표를 존중하며, 불법적으로 다른 사람의 콘텐츠를 공유하는 행위는 금지되어야 합니다.

6. 광고 및 스팸 방지:
- 광고성 콘텐츠는 명시적으로 허가받지 않는 한 금지됩니다.
- 스팸 또는 중복 콘텐츠의 게시는 허용되지 않습니다.
"""
